
Процедура УстановкаПараметровСеанса(ТребуемыеПараметры)
	
 Пользователь = Справочники.Пользователи.НайтиПоНаименованию(ИмяПользователя());
	
 Если Не Пользователь.Пустая()  Тогда
	 ПараметрыСеанса.ТекПользователь = Пользователь;	
 Иначе
	 НовыйПользователь = Справочники.Пользователи.СоздатьЭлемент();
	 НовыйПользователь.Наименование = ИмяПользователя();	
	 НовыйПользователь.Расш1_ДоступРазрешен = Истина;
	 Попытка
		 НовыйПользователь.Записать();
	 Исключение
		 ВызватьИсключение НСтр("ru = 'Не удалось записать нового пользователя'");
	 КонецПопытки;		
	 ПараметрыСеанса.ТекПользователь = НовыйПользователь.Ссылка;
 КонецЕсли;	
	
КонецПроцедуры
