
Процедура Печать(ТабДок, Ссылка) Экспорт

	Макет = Обработки.Макет.ПолучитьМакет("Макет");
	//Запрос = Новый Запрос;
	//Запрос.Текст =
	//"ВЫБРАТЬ
	//|	ТоварыУслуги.Код,
	//|	ТоварыУслуги.Наименование
	//|ИЗ
	//|	Справочник.ТоварыУслуги КАК ТоварыУслуги
	//|ГДЕ
	//|	ТоварыУслуги.Ссылка В (&Ссылка)";
	//Запрос.Параметры.Вставить("Ссылка", Ссылка);
	//Выборка = Запрос.Выполнить().Выбрать();

	//ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	//Шапка = Макет.ПолучитьОбласть("Шапка");
	//ТабДок.Очистить();

	//ВставлятьРазделительСтраниц = Ложь;
	//Пока Выборка.Следующий() Цикл
	//	Если ВставлятьРазделительСтраниц Тогда
	//		ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
	//	КонецЕсли;

		ТабДок.Вывести(Макет);

	//	Шапка.Параметры.Заполнить(Выборка);
	//	ТабДок.Вывести(Шапка, Выборка.Уровень());

		ВставлятьРазделительСтраниц = Истина;
	//КонецЦикла;
	
КонецПроцедуры
